# **Data Transformation**

## **Question 1A**

### **Solution**

In [ ]:
import pandas as pd
import numpy as np
import sklearn.preprocessing as preprocessing

In [ ]:
df_flights = pd.read_csv('https://raw.githubusercontent.com/raneemsultan/Data-Engineering-W21/main/Lab5/flights.csv')

In [ ]:
df_flights.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 160748 entries, 0 to 160747
Data columns (total 17 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Unnamed: 0  160748 non-null  int64
 1   year        160748 non-null  int64
 2   month       160748 non-null  int64
 3   day         160748 non-null  int64
 4   dep_time    160748 non-null  float64
 5   dep_delay   160748 non-null  float64
 6   arr_time    160748 non-null  float64
 7   arr_delay   160748 non-null  float64
 8   carrier     160748 non-null  object
 9   tailnum     160748 non-null  object
 10  flight      160748 non-null  int64
 11  origin      160748 non-null  object
 12  dest        160748 non-null  object
 13  air_time    160748 non-null  float64
 14  distance    160748 non-null  int64
 15  hour        160748 non-null  float64
 16  minute      160748 non-null  float64
dtypes: float64(7), int64(6), object(4)
memory usage: 20.8+ MB

In [ ]:
df_flights.head()

   Unnamed: 0  year  month  day  ...  air_time  distance  hour  minute
0           0  2014      1    1  ...     194.0      1542   0.0     1.0
1           1  2014      1    1  ...     252.0      2279   0.0     4.0
2           2  2014      1    1  ...     201.0      1825   0.0     8.0
3           3  2014      1    1  ...     251.0      2282   0.0    28.0
4           4  2014      1    1  ...     201.0      1448   0.0    34.0

[5 rows x 17 columns]

In [ ]:
df_flights.drop('Unnamed: 0', axis=1, inplace=True)

In [ ]:
df_flights.dtypes

year           int64
month          int64
day            int64
dep_time     float64
dep_delay    float64
arr_time     float64
arr_delay    float64
carrier       object
tailnum       object
flight         int64
origin        object
dest          object
air_time     float64
distance       int64
hour         float64
minute       float64
dtype: object

In [ ]:
print(df_flights.carrier.unique().size)
print(df_flights.tailnum.unique().size)
print(df_flights.origin.unique().size)
print(df_flights.dest.unique().size)

11
3018
2
71

In [ ]:
df_flights_label_encoding = df_flights.select_dtypes('object')
df_flights_label_encoding = df_flights_label_encoding.drop(['origin','carrier'], axis=1)

In [ ]:
def number_encode_features(df):
    result = df.copy() # take a copy of the dataframe
    for column in result.columns:
        if result.dtypes[column] == np.object: # if attribute is categorical
            # Apply LabelEncoder method to attribute
            # fit will infer the number of numerical values needed by counting the number of categories
            # then transform will replace each category with its numerical counterpart
            result[column] = preprocessing.LabelEncoder().fit_transform(result[column])
    return result

label_encoded_data = number_encode_features(df_flights_label_encoding)
label_encoded_data.head()

   tailnum  dest
0     1284     1
1      167    12
2      586    29
3     1426    12
4     2275     1

In [ ]:
df_flights_one_hot_encoding = df_flights[['origin','carrier']]
one_hot_encoded_data = pd.get_dummies(df_flights_one_hot_encoding)
one_hot_encoded_data.head()

   origin_PDX  origin_SEA  carrier_AA  ...  carrier_US  carrier_VX  carrier_WN
0           1           0           0  ...           0           0           0
1           0           1           0  ...           1           0           0
2           1           0           0  ...           0           0           0
3           1           0           0  ...           1           0           0
4           0           1           0  ...           0           0           0

[5 rows x 13 columns]

In [ ]:
df_flights_numeric = df_flights.select_dtypes('number')
df_final = pd.concat([one_hot_encoded_data, label_encoded_data, df_flights_numeric], axis=1)
df_final.head()

   origin_PDX  origin_SEA  carrier_AA  ...  distance  hour  minute
0           1           0           0  ...      1542   0.0     1.0
1           0           1           0  ...      2279   0.0     4.0
2           1           0           0  ...      1825   0.0     8.0
3           1           0           0  ...      2282   0.0    28.0
4           0           1           0  ...      1448   0.0    34.0

[5 rows x 27 columns]

## **Question 1B**

**Justify your choice of encoding method for each attribute.**

### **One Possible Solution**

Encoding the tailnum and dest columns using label encoding not one hot encoding since they have so many unique values

## **Question 2**

Use the following dataset: https://raw.githubusercontent.com/TrainingByPackt/Data-Science-with-Python/master/Chapter01/Data/Student_bucketing.csv

Discretize the `marks` column using the following ranges:['Poor','Below_average','Average','Above_Average','Excellent']. Each range should contain 20 marks. Poor(0-20), Below_average(21-40) and so on till Excellent(80-100).

### **Solution**

In [ ]:
df_students = pd.read_csv('https://raw.githubusercontent.com/TrainingByPackt/Data-Science-with-Python/master/Chapter01/Data/Student_bucketing.csv')

In [ ]:
df_students.head()

   Student_id  Age      Grade Employed  marks
0           1   19  1st Class      yes     29
1           2   20  2nd Class       no     41
2           3   18  1st Class       no     57
3           4   21  2nd Class       no     29
4           5   19  1st Class       no     57

In [ ]:
age_group2 = pd.cut(df_students.marks, [0,20,40,60,80,100],labels=['Poor','Below_average','Average','Above_Average','Excellent'])